web-api/src/test/resources/input/userDefinedRankingTieValueMissing.xml

<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE s [
<!ENTITY x "hello">
]>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://oss.dbc.dk/ns/opensearch">
  <SOAP-ENV:Body>
    <searchRequest>
      <query><![CDATA[danmark]]> and &x;</query>
      <agency>100200</agency>
      <profile>test</profile>
      <callback>cb</callback>
      <userDefinedRanking>
        <!-- tieValue is a required property of userDefinedRanking -->
        <rankField>
          <fieldName>dkcclterm.fo</fieldName>
          <fieldType>word</fieldType>
          <weight>2</weight>
        </rankField>
        <rankField>
          <fieldName>dkcclterm.em</fieldName>
          <fieldType>word</fieldType>
          <weight>4</weight>
        </rankField>
        <rankField>
          <fieldName>dkcclterm.ti</fieldName>
          <fieldType>word</fieldType>
          <weight>8</weight>
        </rankField>
      </userDefinedRanking>
      <collectionType>work-1</collectionType>
    </searchRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
